import classNames from 'classnames';

import { FAQQuestion } from '../../../../components/shared/FAQQuestion';

import leaf from '@/assets/images/faq/leaf.png';

import styles from './FAQ.module.scss';

export const FAQ = () => {
  return (
    <div className={styles.faq}>
      <div className={styles.faq__leaf}>
        <img src={leaf} alt="Leaf" />
      </div>
      <div className={classNames('container', styles.faq__container)}>
        <div className={classNames('title', styles.faq__title)}>FAQ</div>
        <div className={styles.faq__questions}>
          <FAQQuestion
            question="У якому форматі здійснюється доставка здорового харчування по м. Харків?"
            answer="Збалансоване здорове харчування доставляється у формі індивідуального комплекту з трьома - чотирма окремо упакованими стравами на кожен день, які зберігаються в окремих харчових контейнерах."
          />
          <FAQQuestion
            question="Чи потрібно буде постійно їсти одні й ті самі страви?"
            answer="Раціон правильного харчування складено на 4 тижні, і містять в собі різноманітні страви."
          />
          <FAQQuestion
            question="Коли саме ви готуєте страви для правильного харчування?"
            answer="Наша здорова їжа готується виключно вночі, перед його доставкою до вас. Таким чином, ви отримуєте свіжо приготовлені страви з максимальними смаковими та поживними якостями."
          />
          <FAQQuestion
            question="Які продукти використовуються для приготування ваших раціонів?"
            answer="Ми використовуємо тільки свіжі інгредієнти, багаті на необхідні мікроелементи, білки, та корисні жири. Усі страви розроблені для підтримки здоров'я та гарного самопочуття."
          />
          <FAQQuestion
            question="Як організована доставка здорової їжі у Харкові?"
            answer="Кур'єри доставляють раціони здорового харчування щоденно в часовому діапазоні між 7:00 і 10:00. Якщо ви не будете на місці або не зможете відповісти на зв'язок, ваш пакет може бути повторно доставлений на таксі за ваш рахунок або знятий з доставки."
          />
          <FAQQuestion
            question="Чи можу я змінити час або місце доставки раціонів?"
            answer="Можна змінювати час та місце доставки здорового харчування за день до відправки."
          />
          <FAQQuestion
            question="Чи можливо тимчасово призупинити програму здорового харчування?"
            answer={`Ви можете "заморожувати" програму здорового харчування, скільки завгодно разів. Заморожування програми відбувається за день до відправки.`}
          />
          <FAQQuestion
            question="Як правильно організувати режим харчування?"
            answer="На кожному боксі зі стравою зазначено якому прийому їжі кожен відповідає."
          />
          <FAQQuestion
            question="Що робити, якщо я маю алергію на певні продукти?"
            answer="Ми безкоштовно замінюємо 1 інгредієнт у Вашому харчуванні, який Ви не переносите або маєте на нього алергію. Просто повідомте нас про це при замовленні."
          />
        </div>
      </div>
    </div>
  );
};
